app/views/requests/_form.html.erb

      <%= form.label :patient %>
      <%= form.select :patient, options_for_select(Patient.all.map{|p| p.name}), { :include_blank => true, :prompt => 'Select Patient'} %>
---
SELECT "patients".* FROM "patients"

      <%= form.label :hospital %>
      <%= form.select :hospital, options_for_select(Hospital.all.map{|h| h.hospitalname}), { :include_blank => true, :prompt => 'Select Hospital'} %>
---
SELECT "hospitals".* FROM "hospitals"