app/views/doctors/_form.html.erb

      <%= form.label :clinic %>
      <%= form.select :clinic, options_for_select(Clinic.all.map{|c| c.clinicname}), { :include_blank => true, :prompt => 'Select Clinic'} %>
---
SELECT "clinics".* FROM "clinics"