app/controllers/clinics_controller.rb

  def index
    @clinics = Clinic.all
---
SELECT "clinics".* FROM "clinics"

  def create
    @clinic = Clinic.new(clinic_params)

    respond_to do |format|
      if @clinic.save
---
INSERT INTO "clinics" ("clinicname", "clinicaddress", "clinicnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["clinicname", "highfield"], ["clinicaddress", "dublin"], ["clinicnumber", "1589494"], ["created_at", "2018-03-27 16:29:00.843673"], ["updated_at", "2018-03-27 16:29:00.843673"]]

  def destroy
    @clinic.destroy
---
DELETE FROM "clinics" WHERE "clinics"."id" = ?  [["id", 1]]

    def set_clinic
      @clinic = Clinic.find(params[:id])
---
SELECT  "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]