app/controllers/doctors_controller.rb

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("docname", "docaddress", "docnumber", "clinic", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["docname", "huiakv"], ["docaddress", "uaov"], ["docnumber", "vfehou"], ["clinic", "buovef"], ["created_at", "2018-04-18 14:54:28.890877"], ["updated_at", "2018-04-18 14:54:28.890877"]]

  def destroy
    @doctor.destroy
---
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]