app/controllers/hospitals_controller.rb

SELECT "hospitals".* FROM "hospitals"
---
  def index
    @hospitals = Hospital.all

INSERT INTO "hospitals" ("hospitalname", "hospitaladdress", "hospitalnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["hospitalname", "Beaumont"], ["hospitaladdress", "123 road"], ["hospitalnumber", "12356785"], ["created_at", "2018-04-05 16:56:59.643934"], ["updated_at", "2018-04-05 16:56:59.643934"]]
---
  def create
    @hospital = Hospital.new(hospital_params)

    respond_to do |format|
      if @hospital.save

DELETE FROM "hospitals" WHERE "hospitals"."id" = ?  [["id", 3]]
---
  def destroy
    @hospital.destroy

SELECT  "hospitals".* FROM "hospitals" WHERE "hospitals"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_hospital
      @hospital = Hospital.find(params[:id])