app/controllers/requests_controller.rb

INSERT INTO "requests" ("request", "created_at", "updated_at") VALUES (?, ?, ?)  [["request", "CT scan"], ["created_at", "2018-04-03 12:10:07.997300"], ["updated_at", "2018-04-03 12:10:07.997300"]]
---
  def create
    @request = Request.new(request_params)

    respond_to do |format|
      if @request.save

DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]
---
  def destroy
    @request.destroy